SPedt/src/Catalogs/ЗаявкаНаДоставку/ЗаявкаНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаявкаНаДоставку</name>
  <attributes>
    <name>УчастникОтправитель</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ШК</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>secureCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Догрузить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>bulletinId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоступлениеПристроя</name>
    <type>
      <types>DocumentRef.ПоступлениеПристроя</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SPedt/src/CommonModules/СтоСПОбмен_ЗаявкиНаДоставку/Module.bsl
#Область Вспомогательные

Функция СоздатьЗаявкуНаДоставку(об_XDTO,КодУчастникаОтпровителя) Экспорт
	
	КодЗаявки			= Формат(Число(об_XDTO.orderId),"ЧГ=0");
	Заявка				= Справочники.ЗаявкаНаДоставку.НайтиПоКоду(КодЗаявки);	
	Если не ЗначениеЗаполнено(Заявка) Тогда
		обЗаявка		= Справочники.ЗаявкаНаДоставку.СоздатьЭлемент();
		обЗаявка.Код	= КодЗаявки;
	Иначе	
		обЗаявка		= Заявка.ПолучитьОбъект();
	КонецЕсли;	
	обЗаявка.Наименование			= "З("+об_XDTO.requestContent+")";
	обЗаявка.УчастникОтправитель 	= СП_РаботаСоСправочниками.ПолучитьУчастникаПо_Коду(КодУчастникаОтпровителя);
	обЗаявка.Участник         		= СП_РаботаСоСправочниками.ПолучитьУчастникаПо_Коду(об_XDTO.uid);
	обЗаявка.ТочкаНазначения		= СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду(об_XDTO.distributorCode);
	обЗаявка.ОценочнаяСтоимость		= об_XDTO.estimatedCost;
	обЗаявка.bulletinId				= об_XDTO.requestId;
	обЗаявка.secureCode				= об_XDTO.secureCode;
	Попытка
		обЗаявка.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат обЗаявка.Ссылка;	
	
КонецФункции



#КонецОбласти
